**FREE
// The statement after EXEC SQL can start on the next line.
DCL-S connStr VARCHAR(200);
DCL-S n INT(10);

connStr = 'Driver={SQLite3};Database=/tmp/rpgc_test327.sqlite;';
/IF DEFINED(*OPENRPG)
EXEC SQL CONNECT USING :connStr;
/ENDIF
EXEC SQL DROP TABLE IF EXISTS nl327;
EXEC SQL
  CREATE TABLE nl327 (id INTEGER);
EXEC SQL
  INSERT INTO nl327 VALUES(1);
EXEC
  SQL INSERT INTO nl327 VALUES(2);
EXEC SQL
  SELECT COUNT(*)
    INTO :n
    FROM nl327;
DSPLY %CHAR(n);
EXEC SQL DROP TABLE nl327;
/IF DEFINED(*OPENRPG)
EXEC SQL DISCONNECT;
/ENDIF
*INLR = *ON;
RETURN;
