**FREE
// /MESSAGE *ERROR in compiled code fails the compile.
/IF NOT DEFINED(PLATFORM)
/MESSAGE *ERROR 'define PLATFORM to build this'
/ENDIF
*INLR = *ON;
RETURN;
